DataProcessors/СервисныеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОбработки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДополнительныеАдресныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеАдресныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OKATO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчасткаИФНСЮЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчасткаИФНСФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИФНСЮЛ</Name>
					<Comment>Код ИФНС для юридического лица</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИФНСФЛ</Name>
					<Comment>Код ИФНС для физического лица</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДомаЗданияСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДомаЗданияСтроения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресныйОбъект</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныеАдресныеСведения</Name>
					<Comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АдресныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальныйРодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАдресныеСведения</Name>
					<Comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Глобальный уникальный идентификатор адресного объекта ФНС</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияАдресныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияАдресныхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресныйОбъект</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАдресныеСведения</Name>
					<Comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийКодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальныйРодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/СервисныеОбработки/Forms/Перед31/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ИзменитьВидимостьДоступность();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыгружатьФайлыВКаталогПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура РабочийКаталогПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РабочийКаталог) Тогда
		РабочийКаталог = ДобавитьКонечныйРазделительПути(РабочийКаталог);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РабочийКаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок          = НСтр("ru = 'Выберите каталог, в который выгружены файлы конфигурации'");
	ДиалогВыбора.Каталог            = РабочийКаталог(ЭтотОбъект);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("КаталогВыгрузкиКонфигурацииВФайлыЗавершениеВыбора", ЭтотОбъект);
	ДиалогВыбора.Показать(Обработчик);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	КаталогПрограммы = КаталогПрограммы();
	
	Если ПустаяСтрока(РабочийКаталог) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Каталог выгрузки""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "РабочийКаталог");
		Возврат;
	КонецЕсли;
	
	ВыгрузитьКонфигурацию(КаталогПрограммы);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	КаталогПрограммы = КаталогПрограммы();
	
	Если ПустаяСтрока(РабочийКаталог) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Каталог выгрузки""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "РабочийКаталог");
		Возврат;
	КонецЕсли;
		
	ЗагрузитьКонфигурациюИзXML(КаталогПрограммы, РабочийКаталог, Пользователь, Пароль);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ИзменитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КаталогВыгрузкиКонфигурацииВФайлыЗавершениеВыбора(ВыбранныеФайлы, ПараметрыВыполнения) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) <> Тип("Массив")
		Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РабочийКаталог = ДобавитьКонечныйРазделительПути(ВыбранныеФайлы[0]);

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьДоступность()
			
	Элементы.ГруппаОткрытКонфигуратор.Видимость   = ОткрытКонфигуратор();
	Элементы.ГруппаКонфигурацияИзменена.Видимость = КонфигурацияБазыДанныхИзмененаДинамически()
															Или КонфигурацияИзменена();
															
	Элементы.КартинкаПредупреждение32.Видимость = Элементы.ГруппаОткрытКонфигуратор.Видимость ИЛИ Элементы.ГруппаКонфигурацияИзменена.Видимость
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКонфигурацию(КаталогПрограммы)
	
	КаталогВыгрузки = СтрЗаменить(РабочийКаталог(ЭтотОбъект), "\", ПолучитьРазделительПути());
	
	ВыгрузитьКонфигурациюВXML(КаталогПрограммы, КаталогВыгрузки, Пользователь, Пароль);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьКонфигурациюВXML(КаталогПрограммы, РабочийКаталог, Пользователь, Пароль)
	
	ПСТаб = Символы.ПС + Символы.Таб;
	Если ФайлСуществует(РабочийКаталог) Тогда
		УдалитьФайлы(РабочийКаталог, "*");
	Иначе
		СоздатьКаталог(РабочийКаталог);
	КонецЕсли;
	
	ПутьККонфигурации = СтрокаСоединенияИнформационнойБазы();
	КаталогКопии1CD = Неопределено;
	
	Если ОткрытКонфигуратор() Тогда
		
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			
			КаталогИнформационнойБазы = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(ПутьККонфигурации).file;
			КаталогКопии1CD = РабочийКаталог + "BaseCopy" + ПолучитьРазделительПути();
			СоздатьКаталог(КаталогКопии1CD);
			КопироватьФайл(КаталогИнформационнойБазы + "\1Cv8.1CD", КаталогКопии1CD + "1Cv8.1CD");
			ПутьККонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"File=""%1"";", КаталогКопии1CD);
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Для выгрузки модулей необходимо закрыть конфигуратор.'");
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяФайлаСообщений = РабочийКаталог + "Выгрузка.log";
	
	КомандаЗапуска = Новый Массив;
	//КомандаЗапуска.Добавить(КаталогПрограммы() + "\1cv8.exe");
	КомандаЗапуска.Добавить(КаталогПрограммы + "\1cv8.exe");  // клиентский каталог программы
	КомандаЗапуска.Добавить("DESIGNER");
	КомандаЗапуска.Добавить("/IBConnectionString");
	КомандаЗапуска.Добавить(ПутьККонфигурации);
	Если Не ПустаяСтрока(Пользователь) Тогда 
		
		КомандаЗапуска.Добавить("/N");
		КомандаЗапуска.Добавить(Пользователь);
		Если Не ПустаяСтрока(Пароль) Тогда
			КомандаЗапуска.Добавить("/P");
			КомандаЗапуска.Добавить(Пароль);
		КонецЕсли;
		
	КонецЕсли;
	КомандаЗапуска.Добавить("/DumpConfigToFiles");
	КомандаЗапуска.Добавить(РабочийКаталог);
	КомандаЗапуска.Добавить("/Out");
	КомандаЗапуска.Добавить(ИмяФайлаСообщений);
	КомандаЗапуска.Добавить("/DisableStartupMessages");
	КомандаЗапуска.Добавить("/DisableStartupDialogs");
	
	ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	
	//Сообщить(КомандаЗапуска);
	//Сообщить(ПараметрыЗапускаПрограммы);

	Результат = ФайловаяСистема.ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапускаПрограммы);
	
	//	/DumpConfigFiles <каталог выгрузки> [-Module] [-Template] [-Help] [-AllWritable] - выгрузка свойств объектов
	//	метаданных конфигурации.
	//		<Каталог выгрузки> - каталог расположения файлов свойств;
	//		Module - признак необходимости выгрузки модулей;
	//		Template - признак необходимости выгрузки шаблонов;
	//		Help - признак необходимости выгрузки справочной информации;
	//		AllWritable - признак выгрузки свойств только доступных для записи объектов.
	
	Если КаталогКопии1CD <> Неопределено Тогда
		
		Попытка
			УдалитьФайлы(КаталогКопии1CD);
		Исключение
			// Если сейчас каталог еще занят другим процессом, то он будет удален позднее автоматически.
		КонецПопытки;
		
	КонецЕсли;
	
	Если Результат.КодВозврата <> 0 Тогда
		
		Попытка
			ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаСообщений);
			Сообщения = СокрЛП(ЧтениеТекста.Прочитать());
			ЧтениеТекста.Закрыть();
		Исключение
			Сообщения = "";
		КонецПопытки;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выгрузить конфигурацию в XML (код ошибки ""%1"")'"),
			Результат.КодВозврата);
		
		Если Сообщения <> "" Тогда
			ТекстОшибки = ТекстОшибки + ":" + СтрЗаменить(Символы.ПС + Сообщения, Символы.ПС, ПСТаб);
		Иначе
			ТекстОшибки = ТекстОшибки + "."
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайлаСообщений);
	Исключение
		// Если сейчас файл еще занят другим процессом, то он будет удален позднее автоматически.
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьКонфигурациюИзXML(КаталогПрограммы, РабочийКаталог, Пользователь, Пароль)
	
	//ИмяФайлаИзмененныеФайлы = РабочийКаталог + "ИзмененныеФайлы.txt";
	//ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаИзмененныеФайлы, КодировкаТекста.UTF8, , Ложь);
	//ЗаписьТекста.Записать(СтрСоединить(ИзмененныеФайлы, Символы.ПС));
	//ЗаписьТекста.Закрыть();
	//ЗаписьТекста = Неопределено;
	
	ИмяФайлаОшибок = РабочийКаталог + "OutUpload.txt";
	
	//	/LoadConfigFromFiles <каталог загрузки> [-Extension <имя расширения>] [-AllExtensions][-files][-listfile][-format]
	//	- загрузка конфигурации из файлов. Загрузка расширения в основную конфигурацию (и наоборот) не поддерживается.
	//	Допустимо использование следующих опций:
	//		<каталог загрузки> - каталог, содержащий XML-файлы конфигурации;
	//		Extension <Имя расширения> - обработка расширения с указанным именем.
	//			Если расширение успешно обработано возвращает код возврата 0.
	//			В противном случае (если расширение с указанным именем не существует или в процессе работы произошли ошибки) - 1.
	//		AllExtensions - загрузка только расширений (всех).
	//			Если требуемое расширение не существует, оно будет создано.
	//			Для каждого подкаталога указанного каталога будет выполнена попытка создать расширение.
	//			При попытке загрузить расширение в основную конфигурацию или наоборот, будет выведена ошибка.
	//		files - содержит список файлов, которые требуется загрузить. Список разделяется запятыми.
	//			Не используется, если указана опция-listfile.
	//		listfile - указывает файл, в котором перечислены файлы, которые требуется загрузить.
	//			Не используется, если указана опция -files. 
	//			Указываемый файл должен удовлетворять следующим требованиям:
	//			- Файл должен быть в кодировке UTF-8.
	//			- Имена файлов должны быть указаны через перенос.
	//				Поддерживаются символы переноса \r\n ("следующая строка") и \r ("возврат каретки").
	//			- Файл не должен содержать пустые строки между именами файлов.
	//		format - используется для частичной загрузки. Указывает формат загрузки файлов.
	//			По умолчанию загрузка производится в иерархическом формате:
	//			Hierarchical - загрузка выполняется в иерархическом формате.
	//			Plain - загрузка выполняется в линейном формате.
	
	КомандаЗапуска = Новый Массив;
	КомандаЗапуска.Добавить(КаталогПрограммы + "\1cv8.exe");
	КомандаЗапуска.Добавить("DESIGNER");
	КомандаЗапуска.Добавить("/IBConnectionString");
	КомандаЗапуска.Добавить(СтрокаСоединенияИнформационнойБазы());
	Если Не ПустаяСтрока(Пользователь) Тогда 
		КомандаЗапуска.Добавить("/N");
		КомандаЗапуска.Добавить(Пользователь);
		КомандаЗапуска.Добавить("/P");
		КомандаЗапуска.Добавить(Пароль);
	КонецЕсли;
	КомандаЗапуска.Добавить("/LoadConfigFromFiles");
	КомандаЗапуска.Добавить(РабочийКаталог);
	
	//КомандаЗапуска.Добавить("-listFile");
	//КомандаЗапуска.Добавить(ИмяФайлаИзмененныеФайлы);
	//КомандаЗапуска.Добавить("-Files");
	//КомандаЗапуска.Добавить("ConfigDumpInfo.xml");
	
	КомандаЗапуска.Добавить("/Out");
	КомандаЗапуска.Добавить(ИмяФайлаОшибок);
	КомандаЗапуска.Добавить("/DisableStartupMessages");
	КомандаЗапуска.Добавить("/DisableStartupDialogs");
	
	АдресФайлаРучнойЗагрузки = РабочийКаталог + "load.cmd";
	ЗаписьТекста = Новый ЗаписьТекста(АдресФайлаРучнойЗагрузки, КодировкаТекста.OEM);
	ЗаписьТекста.Записать(ОбщегоНазначенияСлужебныйКлиентСервер.БезопаснаяСтрокаКоманды(КомандаЗапуска));
	ЗаписьТекста.Закрыть();
	
	Если ОткрытКонфигуратор() Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Конфигурация не загружена, т.к. открыт конфигуратор.
				|Загрузку можно выполнить в конфигураторе из каталога ""%1"" (или запустив файл ""%2"").'"),
			РабочийКаталог,
			АдресФайлаРучнойЗагрузки);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	
	Результат = ФайловаяСистема.ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапускаПрограммы);
	
	Если Результат.КодВозврата <> 0 Тогда
		
		Если Не ФайлСуществует(ИмяФайлаОшибок) Тогда
			ТекстПричины = "";
		Иначе
			
			Ошибки = Новый ТекстовыйДокумент;
			Ошибки.Прочитать(ИмяФайлаОшибок);
			
			ТекстПричины = НСтр("ru = 'По причине:" + " " + Ошибки.ПолучитьТекст() + ".'");
			
		КонецЕсли;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось загрузить XML конфигурации (код ошибки ""%1""). %2'"),
			Результат.КодВозврата, ТекстПричины);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОткрытКонфигуратор()
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для Каждого Сеанс Из Сеансы Цикл
		Если ВРег(Сеанс.ИмяПриложения) = "DESIGNER" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФайлСуществует(ПолноеИмяФайла)
	
	// АПК:566-выкл обработка работает только синхронно.
	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.Существует();
	// АПК:566-вкл
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьКонечныйРазделительПути(Знач ПутьКаталога)
	
	Если ПустаяСтрока(ПутьКаталога) Тогда
		Возврат ПутьКаталога;
	КонецЕсли;
	
	ДобавляемыйСимвол = ПолучитьРазделительПути();
	
	Если СтрЗаканчиваетсяНа(ПутьКаталога, ДобавляемыйСимвол) Тогда
		Возврат ПутьКаталога;
	Иначе
		Возврат ПутьКаталога + ДобавляемыйСимвол;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РабочийКаталог(Форма)
	
	Если ЗначениеЗаполнено(Форма.РабочийКаталог) Тогда
		Возврат Форма.РабочийКаталог;
	ИначеЕсли СтрНачинаетсяС(Форма.Элементы.РабочийКаталог.ПодсказкаВвода, "<") Тогда
		Возврат "";
	Иначе
		Возврат Форма.Элементы.РабочийКаталог.ПодсказкаВвода;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОбъекты(Команда)
	
	//УдалитьОбъект_ОбщаяКартинка_Информация();
	
	УдалитьОбъект_ОбщаяКоманда_ЗаполнениеОбъекта();
	
	УдалитьОбъект_Подписка_ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе();
	УдалитьОбъект_Подписка_ЗаписатьВерсиюПриОбменеДанными();
	
	УдалитьРеквизиты_РС_ДополнительныеАдресныеСведения();
	УдалитьРеквизиты_РС_ДомаЗданияСтроения();
	УдалитьРеквизиты_РС_АдресныеОбъекты();
	УдалитьРеквизиты_РС_ИсторияАдресныхОбъектов();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражениеКоманды, УровеньРодителя=1)
	
	МассивВыражений = Новый Массив;
	Если ТипЗнч(МассивВыражениеКоманды) = Тип("Строка") Тогда
		МассивВыражений.Добавить(МассивВыражениеКоманды);
	Иначе
	    МассивВыражений = МассивВыражениеКоманды;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлОписания);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
	
	Для каждого ВыражениеКоманды из МассивВыражений Цикл
		РезультатXPath        = ДокументDOM.ВычислитьВыражениеXPath(ВыражениеКоманды, ДокументDOM, Разыменователь);
		
		УзелКоманды = РезультатXPath.ПолучитьСледующий();
		
		Если НЕ УзелКоманды = Неопределено Тогда
			
			Если УровеньРодителя = 1 Тогда
				УзелРодителя = УзелКоманды.РодительскийУзел;
				УзелРодителя.УдалитьДочерний(УзелКоманды);
				
			ИначеЕсли УровеньРодителя = 2 Тогда
				УзелРодителя = УзелКоманды.РодительскийУзел.РодительскийУзел;
				УзелКоманды = УзелКоманды.РодительскийУзел;
				
				УзелРодителя.УдалитьДочерний(УзелКоманды);
				
			ИначеЕсли УровеньРодителя = 3 Тогда
				УзелРодителя = УзелКоманды.РодительскийУзел.РодительскийУзел.РодительскийУзел;
				УзелКоманды = УзелКоманды.РодительскийУзел.РодительскийУзел;
				
				УзелРодителя.УдалитьДочерний(УзелКоманды);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлОписания);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъект_ОбщаяКартинка_Информация()
	
	// удаление команды ЗаполнениеОбъекта
	ПапкаКоманды = РабочийКаталог + "CommonPictures\Информация";
	ФайлКоманды = РабочийКаталог + "CommonPictures\Информация.xml";
	
	// 1
	Файл = Новый Файл(ПапкаКоманды);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ПапкаКоманды);
	КонецЕсли;
	Файл = Новый Файл(ФайлКоманды);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ФайлКоманды);
	КонецЕсли;
	
	// 2
	ФайлОписания = РабочийКаталог + "Configuration.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:CommonPicture[text()='Информация']";	
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
	// 3 
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = НОвый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='CommonPicture.Информация']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='CommonPicture.Информация.Picture']");
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъект_ОбщаяКоманда_ЗаполнениеОбъекта()
	
	// удаление команды ЗаполнениеОбъекта
	ПапкаКоманды = РабочийКаталог + "CommonCommands\ЗаполнениеОбъекта";
	ФайлКоманды = РабочийКаталог + "CommonCommands\ЗаполнениеОбъекта.xml";
	
	// 1
	Файл = Новый Файл(ПапкаКоманды);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ПапкаКоманды);
	КонецЕсли;
	Файл = Новый Файл(ФайлКоманды);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ФайлКоманды);
	КонецЕсли;
	
	// 2
	ФайлОписания = РабочийКаталог + "Configuration.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:CommonCommand[text()='ЗаполнениеОбъекта']";	
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
	// 3 
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='CommonCommand.ЗаполнениеОбъекта']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='CommonCommand.ЗаполнениеОбъекта.CommandModule']");
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
	
	// 4
	ФайлОписания = РабочийКаталог + "Subsystems\СтандартныеПодсистемы\Subsystems\ДополнительныеОтчетыИОбработки.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Subsystem/xmlns:Properties/xmlns:Content/xr:Item[text()='CommonCommand.ЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
	// 5
	ФайлОписания = РабочийКаталог + "FunctionalOptions\ИспользоватьДополнительныеОбработкиЗаполненияОбъекта.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:FunctionalOption/xmlns:Properties/xmlns:Content/xr:Object[text()='CommonCommand.ЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);

	// 6
	ФайлОписания = РабочийКаталог + "Documents\ЧекККМ\Forms\ФормаДокумента\Ext\Form.xml";
	ВыражениеКоманды = "/xmlns:Form/xmlns:CommandInterface/xmlns:CommandBar/xmlns:Item/xmlns:Command[text()='CommonCommand.ЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды, 2);
	
	// 7
	ФайлОписания = РабочийКаталог + "Documents\ПеремещениеТоваров\Forms\ФормаДокумента\Ext\Form.xml";
	ВыражениеКоманды = "/xmlns:Form/xmlns:CommandInterface/xmlns:CommandBar/xmlns:Item/xmlns:Command[text()='CommonCommand.ЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды, 2);
	
	// 8
	ФайлОписания = РабочийКаталог + "Catalogs\ИдентификаторыОбъектовМетаданных\Forms\ФормаЭлемента\Ext\Form.xml";
	ВыражениеКоманды = "/xmlns:Form/xmlns:CommandInterface/xmlns:CommandBar/xmlns:Item/xmlns:Command[text()='CommonCommand.ЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды, 2);
	
	// 9
	ФайлОписания = РабочийКаталог + "Catalogs\КассыККМ\Forms\ФормаЭлемента\Ext\Form.xml";
	ВыражениеКоманды = "/xmlns:Form/xmlns:AutoCommandBar/xmlns:ChildItems/xmlns:ButtonGroup/xmlns:ChildItems/xmlns:Button[@name='ФормаОбщаяКомандаЗаполнениеОбъекта']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъект_Подписка_ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе()
	
	ФайлПодписки = РабочийКаталог + "EventSubscriptions\ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе.xml";
	
	// 1.
	Файл = Новый Файл(ФайлПодписки);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ФайлПодписки);
	КонецЕсли;
	
	// 2.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	ВыражениеКоманды = "/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='EventSubscription.ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе']";	
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
		
	// 3.
	ФайлОписания = РабочийКаталог + "Configuration.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:EventSubscription[text()='ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
	// 4.
	ФайлОписания = РабочийКаталог + "Subsystems\СтандартныеПодсистемы\Subsystems\БазоваяФункциональность.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Subsystem/xmlns:Properties/xmlns:Content/xr:Item[text()='EventSubscription.ВыполнитьДействияПослеОтправкиДанныхУзлаВРаспределеннойИнформационнойБазе']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОбъект_Подписка_ЗаписатьВерсиюПриОбменеДанными()
	
	ФайлПодписки = РабочийКаталог + "EventSubscriptions\ЗаписатьВерсиюПриОбменеДанными.xml";
	
	// 1.
	Файл = Новый Файл(ФайлПодписки);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ФайлПодписки);
	КонецЕсли;
	
	// 2.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	ВыражениеКоманды = "/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata[@name='EventSubscription.ЗаписатьВерсиюПриОбменеДанными']";	
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
		
	// 3.
	ФайлОписания = РабочийКаталог + "Configuration.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:EventSubscription[text()='ЗаписатьВерсиюПриОбменеДанными']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
	// 4.
	ФайлОписания = РабочийКаталог + "Subsystems\СтандартныеПодсистемы\Subsystems\ВерсионированиеОбъектов.xml";
	ВыражениеКоманды = "/xmlns:MetaDataObject/xmlns:Subsystem/xmlns:Properties/xmlns:Content/xr:Item[text()='EventSubscription.ЗаписатьВерсиюПриОбменеДанными']";
	УдалитьОбъектКонфигурации(ФайлОписания, ВыражениеКоманды);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРеквизиты_РС_ДополнительныеАдресныеСведения()
	
	//Удалить РЕСУРСЫ:
	//OKATO	
	//ОКТМО		
	//КодИФНСФЛ		
	//КодИФНСЮЛ		
	//КодУчасткаИФНСФЛ	
	//КодУчасткаИФНСЮЛ
	
	// 1.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.OKATO']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.ОКТМО']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.КодИФНСФЛ']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.КодИФНСЮЛ']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.КодУчасткаИФНСФЛ']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДополнительныеАдресныеСведения.Resource.КодУчасткаИФНСЮЛ']");	
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
		
	// 2.
	ФайлОписания = РабочийКаталог + "InformationRegisters\ДополнительныеАдресныеСведения.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='OKATO']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='ОКТМО']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодИФНСФЛ']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодИФНСЮЛ']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодУчасткаИФНСФЛ']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодУчасткаИФНСЮЛ']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений, 3);
		
КонецПроцедуры

&НаСервере
Процедура УдалитьРеквизиты_РС_ДомаЗданияСтроения()
	
	//	Регистр ДомаЗданияСтроения
	//Удалить ИЗМЕРЕНИЕ:
	//	ПочтовыйИндекс
	//Удалить РЕСУРС:
	//	Строения
	
	// 1.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДомаЗданияСтроения.Dimension.ПочтовыйИндекс']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ДомаЗданияСтроения.Resource.Строения']");	

	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
		
	// 2.
	ФайлОписания = РабочийКаталог + "InformationRegisters\ДомаЗданияСтроения.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='ПочтовыйИндекс']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Строения']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений, 3);
	
	// 3.
	ФайлОписания = РабочийКаталог + "InformationRegisters\ДомаЗданияСтроения\Forms\ФормаСписка\Ext\Form.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='ПочтовыйИндекс']");	
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРеквизиты_РС_АдресныеОбъекты()
	
	//	5. Регистр АдресныеОбъекты
	//Удалить ИЗМЕРЕНИЯ:
	//	Уровень
	//	КодОкруга
	//	КодРайона	
	//	КодГорода	
	//	КодВнутригородскогоРайона	
	//	КодНаселенногоПункта	
	//	КодУлицы	
	//	КодДополнительногоЭлемента	
	//	КодПодчиненногоЭлемента																																																		
	//Удалить РЕСУРСЫ:
	//	ПочтовыйИндекс	<Отсутствует>
	//	Наименование	<Отсутствует>							
	//	Сокращение	<Отсутствует>							
	//	Дополнительно	<Отсутствует>							
	//	КодКЛАДР	<Отсутствует>							
	//	Актуален	<Отсутствует>
	
	// 1.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.Уровень']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодОкруга']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодРайона']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодГорода']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодУлицы']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Dimension.КодПодчиненногоЭлемента']");
	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.ПочтовыйИндекс']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.Наименование']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.Сокращение']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.Дополнительно']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.АдресныеОбъекты.Resource.Актуален']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
		
	// 2.
	ФайлОписания = РабочийКаталог + "InformationRegisters\АдресныеОбъекты.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='Уровень']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодОкруга']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодРайона']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодГорода']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодУлицы']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодПодчиненногоЭлемента']");
	
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='ПочтовыйИндекс']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Наименование']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Сокращение']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Дополнительно']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Актуален']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений, 3);
	
	// 3.
	ФайлОписания = РабочийКаталог + "InformationRegisters\АдресныеОбъекты\Forms\ФормаСписка\Ext\Form.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Уровень']");	
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодОкруга']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодРайона']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодГорода']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодУлицы']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодПодчиненногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='ПочтовыйИндекс']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Наименование']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Сокращение']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Дополнительно']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:CheckBoxField[@name='Актуален']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
		
КонецПроцедуры

&НаСервере
Процедура УдалитьРеквизиты_РС_ИсторияАдресныхОбъектов()
	
//	6. Регистр ИсторияАдресныхОбъектов
//Удалить ИЗМЕРЕНИЯ:
//	Уровень
//	КодОкруга
//	КодРайона	
//	КодГорода	
//	КодВнутригородскогоРайона	
//	КодНаселенногоПункта	
//	КодУлицы	
//	КодДополнительногоЭлемента	
//	КодПодчиненногоЭлемента	
//	ТекущийКодСубъектаРФ	<Отсутствует>																																																								
//Удалить РЕСУРСЫ:
//	ПочтовыйИндекс	<Отсутствует>
//	Наименование	<Отсутствует>							
//	Сокращение	<Отсутствует>							
//	Дополнительно	<Отсутствует>							
//	КодКЛАДР	<Отсутствует>							
//	АдресныйОбъект	<Отсутствует>
//	НачалоДействияЗаписи	<Отсутствует>
//	ОкончаниеДействияЗаписи	<Отсутствует>
//	Операция	<Отсутствует>

	// 1.
	ФайлОписания = РабочийКаталог + "ConfigDumpInfo.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.Уровень']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодОкруга']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодРайона']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодГорода']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодУлицы']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.КодПодчиненногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Dimension.ТекущийКодСубъектаРФ']");
	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.ПочтовыйИндекс']");	
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.Наименование']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.Сокращение']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.Дополнительно']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.АдресныйОбъект']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.НачалоДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.ОкончаниеДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:ConfigDumpInfo/xmlns:ConfigVersions/xmlns:Metadata/xmlns:Metadata[@name='InformationRegister.ИсторияАдресныхОбъектов.Resource.Операция']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
		
	// 2.
	ФайлОписания = РабочийКаталог + "InformationRegisters\ИсторияАдресныхОбъектов.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='Уровень']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодОкруга']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодРайона']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодГорода']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодУлицы']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='КодПодчиненногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties/xmlns:Name[text()='ТекущийКодСубъектаРФ']");
	
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='ПочтовыйИндекс']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Наименование']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Сокращение']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Дополнительно']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='АдресныйОбъект']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='НачалоДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='ОкончаниеДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:MetaDataObject/xmlns:InformationRegister/xmlns:ChildObjects/xmlns:Resource/xmlns:Properties/xmlns:Name[text()='Операция']");
	
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений, 3);
	
	// 3.
	ФайлОписания = РабочийКаталог + "InformationRegisters\ИсторияАдресныхОбъектов\Forms\ФормаСписка\Ext\Form.xml";
	МассивВыражений = Новый Массив;
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Уровень']");	
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодОкруга']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодРайона']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодГорода']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодВнутригородскогоРайона']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодНаселенногоПункта']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодУлицы']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодДополнительногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодПодчиненногоЭлемента']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='ТекущийКодСубъектаРФ']");
	
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='ПочтовыйИндекс']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Наименование']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Сокращение']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Дополнительно']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='КодКЛАДР']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='АдресныйОбъект']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='НачалоДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='ОкончаниеДействияЗаписи']");
	МассивВыражений.Добавить("/xmlns:Form/xmlns:ChildItems/xmlns:Table/xmlns:ChildItems/xmlns:LabelField[@name='Операция']");
	 
	УдалитьОбъектКонфигурации(ФайлОписания, МассивВыражений);
	
КонецПроцедуры

#КонецОбласти
